[
    {
        "image": "bookismall_200h_150.webp",
        "title": "Booki",
        "text": "Développement d'une page d'accueil responsive en HTML/CSS, conforme aux maquettes Figma, avec intégration de composants personnalisés pour une compatibilité optimale sur tous les appareils.",
        "link": "https://github.com/bendahmanenaim/Booki",
        "alt": "Site Booki"
    },
    {
        "image": "SophieBluel.webp",
        "title": "Sophie Bluel",
        "text": "Page de présentation pour une architecte d'intérieur, avec gestion des événements utilisateur en JavaScript et manipulation du DOM. Création d'une page de connexion admin, modale pour l'upload de médias, et communication API pour les tests. Maquettes sur Figma, développement sur Visual Studio Code, gestion de version sur GitHub.",
        "link": "https://github.com/bendahmanenaim/Une_page_web_dynamique_avec_javaScript",
         "alt": "Sophie Bluel, architecte d'intérieur"
    },
    {
        "image": "kasasmall_200.webp",
        "title": "Kasa",
        "text": "Création du front-end d'une application de location immobilière avec React et React Router pour la navigation. Mise en place de la logique des données et des fonctionnalités des composants, initialisé avec Create React App. Malgré un back-end en Node.js, l'accent est mis sur le front-end pour optimiser les tests et la compréhension du développement web moderne.",
        "link": "https://github.com/bendahmanenaim/mon-premier-projet-react",
        "alt": "Application de location immobilière Kasa"
    },
    {
        "image": "ecoblissbath_small_200h_31.webp",
        "title": "Eco Bliss Bath",
        "text": "Définition d'une stratégie de test pour une application bancaire. Analyse des spécifications fonctionnelles, planification des tests agiles, rédaction du cahier de recette et gestion de projet sur Notion.",
        "link": "https://github.com/bendahmanenaim/TesteurLogiciel_Automatisez_des_tests_pour_une_boutique_en_ligne",
        "alt": "Site Eco Bliss Bath"
    },
    {
        "image": "business_200_150.webp",
        "title": "TOMSEN",
        "text": "Définition d'une stratégie de test pour une application bancaire avant sa mise en production. Analyse des spécifications fonctionnelles, planification des tests en mode agile, rédaction d'un cahier de recette, et utilisation de Notion pour la gestion de projet et la documentation.",
        "link": "#",
        "alt": "Une application bancaire"
    },
    {
        "image": "Group 13.png",
        "title": "Qwenta",
        "text": "Développement d’un site web client : rédaction de spécifications, organisation des tâches avec Notion (Kanban), et veille technologique. Présentation de la solution finale sans codage.",
        "link": "#",
         "alt": "site web Qwenta"
    }
]
